dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f413_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F413_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F413_PINMUX_H_)
# define _STM32F413_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define CAN2_RX_FUNC             2
#define CAN2_TX_FUNC             3
#define CAN3_RX_FUNC             4
#define CAN3_TX_FUNC             5
#define DFSDM1_CKIN0_FUNC        6
#define DFSDM1_CKIN1_FUNC        7
#define DFSDM1_CKIN2_FUNC        8
#define DFSDM1_CKIN3_FUNC        9
#define DFSDM1_CKOUT_FUNC        10
#define DFSDM1_DATIN0_FUNC       11
#define DFSDM1_DATIN1_FUNC       12
#define DFSDM1_DATIN2_FUNC       13
#define DFSDM1_DATIN3_FUNC       14
#define DFSDM2_CKIN0_FUNC        15
#define DFSDM2_CKIN1_FUNC        16
#define DFSDM2_CKIN2_FUNC        17
#define DFSDM2_CKIN3_FUNC        18
#define DFSDM2_CKIN4_FUNC        19
#define DFSDM2_CKIN5_FUNC        20
#define DFSDM2_CKIN6_FUNC        21
#define DFSDM2_CKIN7_FUNC        22
#define DFSDM2_CKOUT_FUNC        23
#define DFSDM2_DATIN0_FUNC       24
#define DFSDM2_DATIN1_FUNC       25
#define DFSDM2_DATIN2_FUNC       26
#define DFSDM2_DATIN3_FUNC       27
#define DFSDM2_DATIN4_FUNC       28
#define DFSDM2_DATIN5_FUNC       29
#define DFSDM2_DATIN6_FUNC       30
#define DFSDM2_DATIN7_FUNC       31
#define EVENTOUT_FUNC            32
#define FMPI2C1_SCL_FUNC         33
#define FMPI2C1_SDA_FUNC         34
#define FMPI2C1_SMBA_FUNC        35
#define FSMC_A0_FUNC             36
#define FSMC_A1_FUNC             37
#define FSMC_A10_FUNC            38
#define FSMC_A11_FUNC            39
#define FSMC_A12_FUNC            40
#define FSMC_A13_FUNC            41
#define FSMC_A14_FUNC            42
#define FSMC_A15_FUNC            43
#define FSMC_A16_FUNC            44
#define FSMC_A17_FUNC            45
#define FSMC_A18_FUNC            46
#define FSMC_A19_FUNC            47
#define FSMC_A2_FUNC             48
#define FSMC_A20_FUNC            49
#define FSMC_A21_FUNC            50
#define FSMC_A22_FUNC            51
#define FSMC_A23_FUNC            52
#define FSMC_A24_FUNC            53
#define FSMC_A25_FUNC            54
#define FSMC_A3_FUNC             55
#define FSMC_A4_FUNC             56
#define FSMC_A5_FUNC             57
#define FSMC_A6_FUNC             58
#define FSMC_A7_FUNC             59
#define FSMC_A8_FUNC             60
#define FSMC_A9_FUNC             61
#define FSMC_CLK_FUNC            62
#define FSMC_D0_FUNC             63
#define FSMC_D1_FUNC             64
#define FSMC_D10_FUNC            65
#define FSMC_D11_FUNC            66
#define FSMC_D12_FUNC            67
#define FSMC_D13_FUNC            68
#define FSMC_D14_FUNC            69
#define FSMC_D15_FUNC            70
#define FSMC_D2_FUNC             71
#define FSMC_D3_FUNC             72
#define FSMC_D4_FUNC             73
#define FSMC_D5_FUNC             74
#define FSMC_D6_FUNC             75
#define FSMC_D7_FUNC             76
#define FSMC_D8_FUNC             77
#define FSMC_D9_FUNC             78
#define FSMC_DA0_FUNC            79
#define FSMC_DA1_FUNC            80
#define FSMC_DA10_FUNC           81
#define FSMC_DA11_FUNC           82
#define FSMC_DA12_FUNC           83
#define FSMC_DA13_FUNC           84
#define FSMC_DA14_FUNC           85
#define FSMC_DA15_FUNC           86
#define FSMC_DA2_FUNC            87
#define FSMC_DA3_FUNC            88
#define FSMC_DA4_FUNC            89
#define FSMC_DA5_FUNC            90
#define FSMC_DA6_FUNC            91
#define FSMC_DA7_FUNC            92
#define FSMC_DA8_FUNC            93
#define FSMC_DA9_FUNC            94
#define FSMC_NBL0_FUNC           95
#define FSMC_NBL1_FUNC           96
#define FSMC_NE1_FUNC            97
#define FSMC_NE2_FUNC            98
#define FSMC_NE3_FUNC            99
#define FSMC_NE4_FUNC            100
#define FSMC_NL_FUNC             101
#define FSMC_NOE_FUNC            102
#define FSMC_NWAIT_FUNC          103
#define FSMC_NWE_FUNC            104
#define I2C1_SCL_FUNC            105
#define I2C1_SDA_FUNC            106
#define I2C1_SMBA_FUNC           107
#define I2C2_SCL_FUNC            108
#define I2C2_SDA_FUNC            109
#define I2C2_SMBA_FUNC           110
#define I2C3_SCL_FUNC            111
#define I2C3_SDA_FUNC            112
#define I2C3_SMBA_FUNC           113
#define I2S1_CK_FUNC             114
#define I2S1_MCK_FUNC            115
#define I2S1_SD_FUNC             116
#define I2S1_WS_FUNC             117
#define I2S2_CK_FUNC             118
#define I2S2_MCK_FUNC            119
#define I2S2_SD_FUNC             120
#define I2S2_WS_FUNC             121
#define I2S2_ext_SD_FUNC         122
#define I2S3_CK_FUNC             123
#define I2S3_MCK_FUNC            124
#define I2S3_SD_FUNC             125
#define I2S3_WS_FUNC             126
#define I2S3_ext_SD_FUNC         127
#define I2S4_CK_FUNC             128
#define I2S4_SD_FUNC             129
#define I2S4_WS_FUNC             130
#define I2S5_CK_FUNC             131
#define I2S5_SD_FUNC             132
#define I2S5_WS_FUNC             133
#define I2S_CKIN_FUNC            134
#define LPTIM1_ETR_FUNC          135
#define LPTIM1_IN1_FUNC          136
#define LPTIM1_IN2_FUNC          137
#define LPTIM1_OUT_FUNC          138
#define QUADSPI_BK1_IO0_FUNC     139
#define QUADSPI_BK1_IO1_FUNC     140
#define QUADSPI_BK1_IO2_FUNC     141
#define QUADSPI_BK1_IO3_FUNC     142
#define QUADSPI_BK1_NCS_FUNC     143
#define QUADSPI_BK2_IO0_FUNC     144
#define QUADSPI_BK2_IO1_FUNC     145
#define QUADSPI_BK2_IO2_FUNC     146
#define QUADSPI_BK2_IO3_FUNC     147
#define QUADSPI_BK2_NCS_FUNC     148
#define QUADSPI_CLK_FUNC         149
#define RCC_MCO_1_FUNC           150
#define RCC_MCO_2_FUNC           151
#define RTC_REFIN_FUNC           152
#define SAI1_FS_A_FUNC           153
#define SAI1_FS_B_FUNC           154
#define SAI1_MCLK_A_FUNC         155
#define SAI1_MCLK_B_FUNC         156
#define SAI1_SCK_A_FUNC          157
#define SAI1_SCK_B_FUNC          158
#define SAI1_SD_A_FUNC           159
#define SAI1_SD_B_FUNC           160
#define SDIO_CK_FUNC             161
#define SDIO_CMD_FUNC            162
#define SDIO_D0_FUNC             163
#define SDIO_D1_FUNC             164
#define SDIO_D2_FUNC             165
#define SDIO_D3_FUNC             166
#define SDIO_D4_FUNC             167
#define SDIO_D5_FUNC             168
#define SDIO_D6_FUNC             169
#define SDIO_D7_FUNC             170
#define SPI1_MISO_FUNC           171
#define SPI1_MOSI_FUNC           172
#define SPI1_NSS_FUNC            173
#define SPI1_SCK_FUNC            174
#define SPI2_MISO_FUNC           175
#define SPI2_MOSI_FUNC           176
#define SPI2_NSS_FUNC            177
#define SPI2_SCK_FUNC            178
#define SPI3_MISO_FUNC           179
#define SPI3_MOSI_FUNC           180
#define SPI3_NSS_FUNC            181
#define SPI3_SCK_FUNC            182
#define SPI4_MISO_FUNC           183
#define SPI4_MOSI_FUNC           184
#define SPI4_NSS_FUNC            185
#define SPI4_SCK_FUNC            186
#define SPI5_MISO_FUNC           187
#define SPI5_MOSI_FUNC           188
#define SPI5_NSS_FUNC            189
#define SPI5_SCK_FUNC            190
#define SYS_JTCK_SWCLK_FUNC      191
#define SYS_JTDI_FUNC            192
#define SYS_JTDO_SWO_FUNC        193
#define SYS_JTMS_SWDIO_FUNC      194
#define SYS_JTRST_FUNC           195
#define SYS_TRACECLK_FUNC        196
#define SYS_TRACED0_FUNC         197
#define SYS_TRACED1_FUNC         198
#define SYS_TRACED2_FUNC         199
#define SYS_TRACED3_FUNC         200
#define TIM10_CH1_FUNC           201
#define TIM11_CH1_FUNC           202
#define TIM12_CH1_FUNC           203
#define TIM12_CH2_FUNC           204
#define TIM13_CH1_FUNC           205
#define TIM14_CH1_FUNC           206
#define TIM1_BKIN_FUNC           207
#define TIM1_CH1_FUNC            208
#define TIM1_CH1N_FUNC           209
#define TIM1_CH2_FUNC            210
#define TIM1_CH2N_FUNC           211
#define TIM1_CH3_FUNC            212
#define TIM1_CH3N_FUNC           213
#define TIM1_CH4_FUNC            214
#define TIM1_ETR_FUNC            215
#define TIM2_CH1_FUNC            216
#define TIM2_CH2_FUNC            217
#define TIM2_CH3_FUNC            218
#define TIM2_CH4_FUNC            219
#define TIM2_ETR_FUNC            220
#define TIM3_CH1_FUNC            221
#define TIM3_CH2_FUNC            222
#define TIM3_CH3_FUNC            223
#define TIM3_CH4_FUNC            224
#define TIM3_ETR_FUNC            225
#define TIM4_CH1_FUNC            226
#define TIM4_CH2_FUNC            227
#define TIM4_CH3_FUNC            228
#define TIM4_CH4_FUNC            229
#define TIM4_ETR_FUNC            230
#define TIM5_CH1_FUNC            231
#define TIM5_CH2_FUNC            232
#define TIM5_CH3_FUNC            233
#define TIM5_CH4_FUNC            234
#define TIM8_BKIN_FUNC           235
#define TIM8_CH1_FUNC            236
#define TIM8_CH1N_FUNC           237
#define TIM8_CH2_FUNC            238
#define TIM8_CH2N_FUNC           239
#define TIM8_CH3_FUNC            240
#define TIM8_CH3N_FUNC           241
#define TIM8_CH4_FUNC            242
#define TIM8_ETR_FUNC            243
#define TIM9_CH1_FUNC            244
#define TIM9_CH2_FUNC            245
#define UART10_RX_FUNC           246
#define UART10_TX_FUNC           247
#define UART4_RX_FUNC            248
#define UART4_TX_FUNC            249
#define UART5_RX_FUNC            250
#define UART5_TX_FUNC            251
#define UART7_RX_FUNC            252
#define UART7_TX_FUNC            253
#define UART8_RX_FUNC            254
#define UART8_TX_FUNC            255
#define UART9_RX_FUNC            256
#define UART9_TX_FUNC            257
#define USART1_CK_FUNC           258
#define UART1_CK_FUNC            258
#define USART1_CTS_FUNC          259
#define UART1_CTS_FUNC           259
#define USART1_RTS_FUNC          260
#define UART1_RTS_FUNC           260
#define USART1_RX_FUNC           261
#define UART1_RX_FUNC            261
#define USART1_TX_FUNC           262
#define UART1_TX_FUNC            262
#define USART2_CK_FUNC           263
#define UART2_CK_FUNC            263
#define USART2_CTS_FUNC          264
#define UART2_CTS_FUNC           264
#define USART2_RTS_FUNC          265
#define UART2_RTS_FUNC           265
#define USART2_RX_FUNC           266
#define UART2_RX_FUNC            266
#define USART2_TX_FUNC           267
#define UART2_TX_FUNC            267
#define USART3_CK_FUNC           268
#define UART3_CK_FUNC            268
#define USART3_CTS_FUNC          269
#define UART3_CTS_FUNC           269
#define USART3_RTS_FUNC          270
#define UART3_RTS_FUNC           270
#define USART3_RX_FUNC           271
#define UART3_RX_FUNC            271
#define USART3_TX_FUNC           272
#define UART3_TX_FUNC            272
#define USART6_CK_FUNC           273
#define UART6_CK_FUNC            273
#define USART6_CTS_FUNC          274
#define UART6_CTS_FUNC           274
#define USART6_RTS_FUNC          275
#define UART6_RTS_FUNC           275
#define USART6_RX_FUNC           276
#define UART6_RX_FUNC            276
#define USART6_TX_FUNC           277
#define UART6_TX_FUNC            277
#define USB_OTG_FS_DM_FUNC       278
#define USB_OTG_FS_DP_FUNC       279
#define USB_OTG_FS_ID_FUNC       280
#define USB_OTG_FS_SOF_FUNC      281
#define USB_OTG_FS_VBUS_FUNC     282

