dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f413_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PA00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == I2S4_SD_FUNC             )) ?  5 : \
	((gpio == PA01) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PA01) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PA02) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == FSMC_D4_FUNC             )) ? 12 : \
	((gpio == PA02) && (func == FSMC_DA4_FUNC            )) ? 12 : \
	((gpio == PA02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PA03) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == SAI1_SD_B_FUNC           )) ? 10 : \
	((gpio == PA03) && (func == FSMC_D5_FUNC             )) ? 12 : \
	((gpio == PA03) && (func == FSMC_DA5_FUNC            )) ? 12 : \
	((gpio == PA03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA04) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == DFSDM1_DATIN1_FUNC       )) ?  8 : \
	((gpio == PA04) && (func == FSMC_D6_FUNC             )) ? 12 : \
	((gpio == PA04) && (func == FSMC_DA6_FUNC            )) ? 12 : \
	((gpio == PA04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA05) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == DFSDM1_CKIN1_FUNC        )) ?  8 : \
	((gpio == PA05) && (func == FSMC_D7_FUNC             )) ? 12 : \
	((gpio == PA05) && (func == FSMC_DA7_FUNC            )) ? 12 : \
	((gpio == PA05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == I2S2_MCK_FUNC            )) ?  6 : \
	((gpio == PA06) && (func == DFSDM2_CKIN1_FUNC        )) ?  7 : \
	((gpio == PA06) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PA06) && (func == QUADSPI_BK2_IO0_FUNC     )) ? 10 : \
	((gpio == PA06) && (func == SDIO_CMD_FUNC            )) ? 12 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA07) && (func == I2S1_SD_FUNC             )) ?  5 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == DFSDM2_DATIN1_FUNC       )) ?  7 : \
	((gpio == PA07) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PA07) && (func == QUADSPI_BK2_IO1_FUNC     )) ? 10 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA08) && (func == RCC_MCO_1_FUNC           )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA08) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PA08) && (func == USB_OTG_FS_SOF_FUNC      )) ? 10 : \
	((gpio == PA08) && (func == CAN3_RX_FUNC             )) ? 11 : \
	((gpio == PA08) && (func == SDIO_D1_FUNC             )) ? 12 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == DFSDM2_CKIN3_FUNC        )) ?  3 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PA09) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == USB_OTG_FS_VBUS_FUNC     )) ? 10 : \
	((gpio == PA09) && (func == SDIO_D2_FUNC             )) ? 12 : \
	((gpio == PA09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == DFSDM2_DATIN3_FUNC       )) ?  3 : \
	((gpio == PA10) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PA10) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PA10) && (func == I2S5_SD_FUNC             )) ?  6 : \
	((gpio == PA10) && (func == SPI5_MOSI_FUNC           )) ?  6 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == USB_OTG_FS_ID_FUNC       )) ? 10 : \
	((gpio == PA10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == DFSDM2_CKIN5_FUNC        )) ?  3 : \
	((gpio == PA11) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PA11) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PA11) && (func == SPI4_MISO_FUNC           )) ?  6 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PA11) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PA11) && (func == USB_OTG_FS_DM_FUNC       )) ? 10 : \
	((gpio == PA11) && (func == UART4_RX_FUNC            )) ? 11 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == DFSDM2_DATIN5_FUNC       )) ?  3 : \
	((gpio == PA12) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PA12) && (func == SPI5_MISO_FUNC           )) ?  6 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PA12) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PA12) && (func == USB_OTG_FS_DP_FUNC       )) ? 10 : \
	((gpio == PA12) && (func == UART4_TX_FUNC            )) ? 11 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA15) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA15) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA15) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PA15) && (func == SAI1_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PA15) && (func == CAN3_TX_FUNC             )) ? 11 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB00) && (func == I2S5_CK_FUNC             )) ?  6 : \
	((gpio == PB00) && (func == SPI5_SCK_FUNC            )) ?  6 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB01) && (func == I2S5_WS_FUNC             )) ?  6 : \
	((gpio == PB01) && (func == SPI5_NSS_FUNC            )) ?  6 : \
	((gpio == PB01) && (func == DFSDM1_DATIN0_FUNC       )) ?  8 : \
	((gpio == PB01) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PB01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PB02) && (func == DFSDM1_CKIN0_FUNC        )) ?  6 : \
	((gpio == PB02) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PB02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB03) && (func == SYS_JTDO_SWO_FUNC        )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PB03) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PB03) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PB03) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB03) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PB03) && (func == I2C2_SDA_FUNC            )) ?  9 : \
	((gpio == PB03) && (func == SAI1_SD_A_FUNC           )) ? 10 : \
	((gpio == PB03) && (func == CAN3_RX_FUNC             )) ? 11 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == I2S3_ext_SD_FUNC         )) ?  5 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PB04) && (func == I2C3_SDA_FUNC            )) ?  9 : \
	((gpio == PB04) && (func == SAI1_SCK_A_FUNC          )) ? 10 : \
	((gpio == PB04) && (func == CAN3_TX_FUNC             )) ? 11 : \
	((gpio == PB04) && (func == SDIO_D0_FUNC             )) ? 12 : \
	((gpio == PB04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == I2S1_SD_FUNC             )) ?  5 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == CAN2_RX_FUNC             )) ?  9 : \
	((gpio == PB05) && (func == SAI1_FS_A_FUNC           )) ? 10 : \
	((gpio == PB05) && (func == UART5_RX_FUNC            )) ? 11 : \
	((gpio == PB05) && (func == SDIO_D3_FUNC             )) ? 12 : \
	((gpio == PB05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == DFSDM2_CKIN7_FUNC        )) ?  6 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == CAN2_TX_FUNC             )) ?  9 : \
	((gpio == PB06) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PB06) && (func == UART5_TX_FUNC            )) ? 11 : \
	((gpio == PB06) && (func == SDIO_D0_FUNC             )) ? 12 : \
	((gpio == PB06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == DFSDM2_DATIN7_FUNC       )) ?  6 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == FSMC_NL_FUNC             )) ? 12 : \
	((gpio == PB07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB08) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == I2S5_SD_FUNC             )) ?  6 : \
	((gpio == PB08) && (func == SPI5_MOSI_FUNC           )) ?  6 : \
	((gpio == PB08) && (func == DFSDM2_CKIN1_FUNC        )) ?  7 : \
	((gpio == PB08) && (func == CAN1_RX_FUNC             )) ?  8 : \
	((gpio == PB08) && (func == I2C3_SDA_FUNC            )) ?  9 : \
	((gpio == PB08) && (func == UART5_RX_FUNC            )) ? 11 : \
	((gpio == PB08) && (func == SDIO_D4_FUNC             )) ? 12 : \
	((gpio == PB08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == DFSDM2_DATIN1_FUNC       )) ?  6 : \
	((gpio == PB09) && (func == CAN1_TX_FUNC             )) ?  8 : \
	((gpio == PB09) && (func == I2C2_SDA_FUNC            )) ?  9 : \
	((gpio == PB09) && (func == UART5_TX_FUNC            )) ? 11 : \
	((gpio == PB09) && (func == SDIO_D5_FUNC             )) ? 12 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == FMPI2C1_SCL_FUNC         )) ?  9 : \
	((gpio == PB10) && (func == DFSDM2_CKOUT_FUNC        )) ? 10 : \
	((gpio == PB10) && (func == SDIO_D7_FUNC             )) ? 12 : \
	((gpio == PB10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == I2S3_CK_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == I2S4_WS_FUNC             )) ?  6 : \
	((gpio == PB12) && (func == SPI4_NSS_FUNC            )) ?  6 : \
	((gpio == PB12) && (func == SPI3_SCK_FUNC            )) ?  7 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  8 : \
	((gpio == PB12) && (func == CAN2_RX_FUNC             )) ?  9 : \
	((gpio == PB12) && (func == DFSDM1_DATIN1_FUNC       )) ? 10 : \
	((gpio == PB12) && (func == UART5_RX_FUNC            )) ? 11 : \
	((gpio == PB12) && (func == FSMC_D13_FUNC            )) ? 12 : \
	((gpio == PB12) && (func == FSMC_DA13_FUNC           )) ? 12 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == FMPI2C1_SMBA_FUNC        )) ?  4 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == I2S4_CK_FUNC             )) ?  6 : \
	((gpio == PB13) && (func == SPI4_SCK_FUNC            )) ?  6 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  8 : \
	((gpio == PB13) && (func == CAN2_TX_FUNC             )) ?  9 : \
	((gpio == PB13) && (func == DFSDM1_CKIN1_FUNC        )) ? 10 : \
	((gpio == PB13) && (func == UART5_TX_FUNC            )) ? 11 : \
	((gpio == PB13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB14) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == DFSDM1_DATIN2_FUNC       )) ?  8 : \
	((gpio == PB14) && (func == TIM12_CH1_FUNC           )) ?  9 : \
	((gpio == PB14) && (func == FSMC_D0_FUNC             )) ? 10 : \
	((gpio == PB14) && (func == FSMC_DA0_FUNC            )) ? 10 : \
	((gpio == PB14) && (func == SDIO_D6_FUNC             )) ? 12 : \
	((gpio == PB14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == DFSDM1_CKIN2_FUNC        )) ?  8 : \
	((gpio == PB15) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PB15) && (func == SDIO_CK_FUNC             )) ? 12 : \
	((gpio == PB15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PC00) && (func == DFSDM2_CKIN4_FUNC        )) ?  3 : \
	((gpio == PC00) && (func == SAI1_MCLK_B_FUNC         )) ?  7 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PC01) && (func == DFSDM2_DATIN4_FUNC       )) ?  3 : \
	((gpio == PC01) && (func == SAI1_SD_B_FUNC           )) ?  7 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PC02) && (func == DFSDM2_DATIN7_FUNC       )) ?  3 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PC02) && (func == SAI1_SCK_B_FUNC          )) ?  7 : \
	((gpio == PC02) && (func == DFSDM1_CKOUT_FUNC        )) ?  8 : \
	((gpio == PC02) && (func == FSMC_NWE_FUNC            )) ? 12 : \
	((gpio == PC02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PC03) && (func == DFSDM2_CKIN7_FUNC        )) ?  3 : \
	((gpio == PC03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == SAI1_FS_B_FUNC           )) ?  7 : \
	((gpio == PC03) && (func == FSMC_A0_FUNC             )) ? 12 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC04) && (func == DFSDM2_CKIN2_FUNC        )) ?  3 : \
	((gpio == PC04) && (func == I2S1_MCK_FUNC            )) ?  5 : \
	((gpio == PC04) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 10 : \
	((gpio == PC04) && (func == FSMC_NE4_FUNC            )) ? 12 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC05) && (func == DFSDM2_DATIN2_FUNC       )) ?  3 : \
	((gpio == PC05) && (func == FMPI2C1_SMBA_FUNC        )) ?  4 : \
	((gpio == PC05) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC05) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PC05) && (func == FSMC_NOE_FUNC            )) ? 12 : \
	((gpio == PC05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PC06) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PC06) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PC06) && (func == DFSDM1_CKIN3_FUNC        )) ?  6 : \
	((gpio == PC06) && (func == DFSDM2_DATIN6_FUNC       )) ?  7 : \
	((gpio == PC06) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PC06) && (func == FSMC_D1_FUNC             )) ? 10 : \
	((gpio == PC06) && (func == FSMC_DA1_FUNC            )) ? 10 : \
	((gpio == PC06) && (func == SDIO_D6_FUNC             )) ? 12 : \
	((gpio == PC06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PC07) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PC07) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PC07) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PC07) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PC07) && (func == DFSDM2_CKIN6_FUNC        )) ?  7 : \
	((gpio == PC07) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PC07) && (func == DFSDM1_DATIN3_FUNC       )) ? 10 : \
	((gpio == PC07) && (func == SDIO_D7_FUNC             )) ? 12 : \
	((gpio == PC07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PC08) && (func == DFSDM2_CKIN3_FUNC        )) ?  7 : \
	((gpio == PC08) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PC08) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PC08) && (func == SDIO_D0_FUNC             )) ? 12 : \
	((gpio == PC08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC09) && (func == RCC_MCO_2_FUNC           )) ?  0 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PC09) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PC09) && (func == DFSDM2_DATIN3_FUNC       )) ?  7 : \
	((gpio == PC09) && (func == QUADSPI_BK1_IO0_FUNC     )) ?  9 : \
	((gpio == PC09) && (func == SDIO_D1_FUNC             )) ? 12 : \
