dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f413_pinmux.h
	((gpio == PC09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC10) && (func == DFSDM2_CKIN5_FUNC        )) ?  3 : \
	((gpio == PC10) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == QUADSPI_BK1_IO1_FUNC     )) ?  9 : \
	((gpio == PC10) && (func == SDIO_D2_FUNC             )) ? 12 : \
	((gpio == PC10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC11) && (func == DFSDM2_DATIN5_FUNC       )) ?  3 : \
	((gpio == PC11) && (func == I2S3_ext_SD_FUNC         )) ?  5 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == QUADSPI_BK2_NCS_FUNC     )) ?  9 : \
	((gpio == PC11) && (func == FSMC_D2_FUNC             )) ? 10 : \
	((gpio == PC11) && (func == FSMC_DA2_FUNC            )) ? 10 : \
	((gpio == PC11) && (func == SDIO_D3_FUNC             )) ? 12 : \
	((gpio == PC11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC12) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == FSMC_D3_FUNC             )) ? 10 : \
	((gpio == PC12) && (func == FSMC_DA3_FUNC            )) ? 10 : \
	((gpio == PC12) && (func == SDIO_CK_FUNC             )) ? 12 : \
	((gpio == PC12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD00) && (func == DFSDM2_CKIN6_FUNC        )) ?  3 : \
	((gpio == PD00) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PD00) && (func == UART4_RX_FUNC            )) ? 11 : \
	((gpio == PD00) && (func == FSMC_D2_FUNC             )) ? 12 : \
	((gpio == PD00) && (func == FSMC_DA2_FUNC            )) ? 12 : \
	((gpio == PD00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD01) && (func == DFSDM2_DATIN6_FUNC       )) ?  3 : \
	((gpio == PD01) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PD01) && (func == UART4_TX_FUNC            )) ? 11 : \
	((gpio == PD01) && (func == FSMC_D3_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == FSMC_DA3_FUNC            )) ? 12 : \
	((gpio == PD01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == DFSDM2_CKOUT_FUNC        )) ?  3 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == FSMC_NWE_FUNC            )) ? 10 : \
	((gpio == PD02) && (func == SDIO_CMD_FUNC            )) ? 12 : \
	((gpio == PD02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD03) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PD03) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD03) && (func == DFSDM1_DATIN0_FUNC       )) ?  6 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PD03) && (func == FSMC_CLK_FUNC            )) ? 12 : \
	((gpio == PD03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD04) && (func == DFSDM1_CKIN0_FUNC        )) ?  6 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == FSMC_NOE_FUNC            )) ? 12 : \
	((gpio == PD04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD05) && (func == DFSDM2_CKOUT_FUNC        )) ?  3 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == FSMC_NWE_FUNC            )) ? 12 : \
	((gpio == PD05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD06) && (func == I2S3_SD_FUNC             )) ?  5 : \
	((gpio == PD06) && (func == SPI3_MOSI_FUNC           )) ?  5 : \
	((gpio == PD06) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == FSMC_NWAIT_FUNC          )) ? 12 : \
	((gpio == PD06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD07) && (func == DFSDM1_CKIN1_FUNC        )) ?  6 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == FSMC_NE1_FUNC            )) ? 12 : \
	((gpio == PD07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == FSMC_D13_FUNC            )) ? 12 : \
	((gpio == PD08) && (func == FSMC_DA13_FUNC           )) ? 12 : \
	((gpio == PD08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == FSMC_D14_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == FSMC_DA14_FUNC           )) ? 12 : \
	((gpio == PD09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PD10) && (func == FSMC_D15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == FSMC_DA15_FUNC           )) ? 12 : \
	((gpio == PD10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD11) && (func == DFSDM2_DATIN2_FUNC       )) ?  3 : \
	((gpio == PD11) && (func == FMPI2C1_SMBA_FUNC        )) ?  4 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == QUADSPI_BK1_IO0_FUNC     )) ?  9 : \
	((gpio == PD11) && (func == FSMC_A16_FUNC            )) ? 12 : \
	((gpio == PD11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == DFSDM2_CKIN2_FUNC        )) ?  3 : \
	((gpio == PD12) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == QUADSPI_BK1_IO1_FUNC     )) ?  9 : \
	((gpio == PD12) && (func == FSMC_A17_FUNC            )) ? 12 : \
	((gpio == PD12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PD13) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PD13) && (func == FSMC_A18_FUNC            )) ? 12 : \
	((gpio == PD13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PD14) && (func == DFSDM2_CKIN0_FUNC        )) ? 10 : \
	((gpio == PD14) && (func == UART9_RX_FUNC            )) ? 11 : \
	((gpio == PD14) && (func == FSMC_D0_FUNC             )) ? 12 : \
	((gpio == PD14) && (func == FSMC_DA0_FUNC            )) ? 12 : \
	((gpio == PD14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PD15) && (func == DFSDM2_DATIN0_FUNC       )) ? 10 : \
	((gpio == PD15) && (func == UART9_TX_FUNC            )) ? 11 : \
	((gpio == PD15) && (func == FSMC_D1_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == FSMC_DA1_FUNC            )) ? 12 : \
	((gpio == PD15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == DFSDM2_CKIN4_FUNC        )) ?  3 : \
	((gpio == PE00) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PE00) && (func == FSMC_NBL0_FUNC           )) ? 12 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE01) && (func == DFSDM2_DATIN4_FUNC       )) ?  3 : \
	((gpio == PE01) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PE01) && (func == FSMC_NBL1_FUNC           )) ? 12 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE02) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PE02) && (func == I2S4_CK_FUNC             )) ?  5 : \
	((gpio == PE02) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE02) && (func == I2S5_CK_FUNC             )) ?  6 : \
	((gpio == PE02) && (func == SPI5_SCK_FUNC            )) ?  6 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ?  7 : \
	((gpio == PE02) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PE02) && (func == UART10_RX_FUNC           )) ? 11 : \
	((gpio == PE02) && (func == FSMC_A23_FUNC            )) ? 12 : \
	((gpio == PE02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE03) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ?  7 : \
	((gpio == PE03) && (func == UART10_TX_FUNC           )) ? 11 : \
	((gpio == PE03) && (func == FSMC_A19_FUNC            )) ? 12 : \
	((gpio == PE03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE04) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PE04) && (func == I2S4_WS_FUNC             )) ?  5 : \
	((gpio == PE04) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE04) && (func == I2S5_WS_FUNC             )) ?  6 : \
	((gpio == PE04) && (func == SPI5_NSS_FUNC            )) ?  6 : \
	((gpio == PE04) && (func == SAI1_SD_A_FUNC           )) ?  7 : \
	((gpio == PE04) && (func == DFSDM1_DATIN3_FUNC       )) ?  8 : \
	((gpio == PE04) && (func == FSMC_A20_FUNC            )) ? 12 : \
	((gpio == PE04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE05) && (func == SPI5_MISO_FUNC           )) ?  6 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ?  7 : \
	((gpio == PE05) && (func == DFSDM1_CKIN3_FUNC        )) ?  8 : \
	((gpio == PE05) && (func == FSMC_A21_FUNC            )) ? 12 : \
	((gpio == PE05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PE06) && (func == I2S4_SD_FUNC             )) ?  5 : \
	((gpio == PE06) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE06) && (func == I2S5_SD_FUNC             )) ?  6 : \
	((gpio == PE06) && (func == SPI5_MOSI_FUNC           )) ?  6 : \
	((gpio == PE06) && (func == SAI1_FS_A_FUNC           )) ?  7 : \
	((gpio == PE06) && (func == FSMC_A22_FUNC            )) ? 12 : \
	((gpio == PE06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == DFSDM1_DATIN2_FUNC       )) ?  6 : \
	((gpio == PE07) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PE07) && (func == QUADSPI_BK2_IO0_FUNC     )) ? 10 : \
	((gpio == PE07) && (func == FSMC_D4_FUNC             )) ? 12 : \
	((gpio == PE07) && (func == FSMC_DA4_FUNC            )) ? 12 : \
	((gpio == PE07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == DFSDM1_CKIN2_FUNC        )) ?  6 : \
	((gpio == PE08) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PE08) && (func == QUADSPI_BK2_IO1_FUNC     )) ? 10 : \
	((gpio == PE08) && (func == FSMC_D5_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == FSMC_DA5_FUNC            )) ? 12 : \
	((gpio == PE08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PE09) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 10 : \
	((gpio == PE09) && (func == FSMC_D6_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == FSMC_DA6_FUNC            )) ? 12 : \
	((gpio == PE09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == DFSDM2_DATIN0_FUNC       )) ?  3 : \
	((gpio == PE10) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PE10) && (func == FSMC_D7_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == FSMC_DA7_FUNC            )) ? 12 : \
	((gpio == PE10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == DFSDM2_CKIN0_FUNC        )) ?  3 : \
	((gpio == PE11) && (func == I2S4_WS_FUNC             )) ?  5 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == I2S5_WS_FUNC             )) ?  6 : \
	((gpio == PE11) && (func == SPI5_NSS_FUNC            )) ?  6 : \
	((gpio == PE11) && (func == FSMC_D8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == FSMC_DA8_FUNC            )) ? 12 : \
	((gpio == PE11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == DFSDM2_DATIN7_FUNC       )) ?  3 : \
	((gpio == PE12) && (func == I2S4_CK_FUNC             )) ?  5 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == I2S5_CK_FUNC             )) ?  6 : \
	((gpio == PE12) && (func == SPI5_SCK_FUNC            )) ?  6 : \
	((gpio == PE12) && (func == FSMC_D9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == FSMC_DA9_FUNC            )) ? 12 : \
	((gpio == PE12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == DFSDM2_CKIN7_FUNC        )) ?  3 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == SPI5_MISO_FUNC           )) ?  6 : \
	((gpio == PE13) && (func == FSMC_D10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == FSMC_DA10_FUNC           )) ? 12 : \
	((gpio == PE13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == I2S4_SD_FUNC             )) ?  5 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == I2S5_SD_FUNC             )) ?  6 : \
	((gpio == PE14) && (func == SPI5_MOSI_FUNC           )) ?  6 : \
	((gpio == PE14) && (func == DFSDM2_DATIN1_FUNC       )) ? 10 : \
	((gpio == PE14) && (func == FSMC_D11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == FSMC_DA11_FUNC           )) ? 12 : \
	((gpio == PE14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == DFSDM2_CKIN1_FUNC        )) ? 10 : \
	((gpio == PE15) && (func == FSMC_D12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == FSMC_DA12_FUNC           )) ? 12 : \
	((gpio == PE15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == FSMC_A0_FUNC             )) ? 12 : \
	((gpio == PF00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == FSMC_A1_FUNC             )) ? 12 : \
	((gpio == PF01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FSMC_A2_FUNC             )) ? 12 : \
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF03) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PF03) && (func == FSMC_A3_FUNC             )) ? 12 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF04) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PF04) && (func == FSMC_A4_FUNC             )) ? 12 : \
	((gpio == PF04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF05) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PF05) && (func == FSMC_A5_FUNC             )) ? 12 : \
	((gpio == PF05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF06) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PF06) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  7 : \
	((gpio == PF06) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PF06) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PF06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF07) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PF07) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  7 : \
	((gpio == PF07) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PF07) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PF07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  7 : \
	((gpio == PF08) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PF08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  7 : \
	((gpio == PF09) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF10) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PF10) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PF10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF11) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PF11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF12) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PF12) && (func == FSMC_A6_FUNC             )) ? 12 : \
	((gpio == PF12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF13) && (func == FMPI2C1_SMBA_FUNC        )) ?  4 : \
	((gpio == PF13) && (func == FSMC_A7_FUNC             )) ? 12 : \
	((gpio == PF13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF14) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PF14) && (func == FSMC_A8_FUNC             )) ? 12 : \
	((gpio == PF14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF15) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PF15) && (func == FSMC_A9_FUNC             )) ? 12 : \
	((gpio == PF15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG00) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PG00) && (func == UART9_RX_FUNC            )) ? 11 : \
	((gpio == PG00) && (func == FSMC_A10_FUNC            )) ? 12 : \
	((gpio == PG00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG01) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PG01) && (func == UART9_TX_FUNC            )) ? 11 : \
	((gpio == PG01) && (func == FSMC_A11_FUNC            )) ? 12 : \
	((gpio == PG01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG02) && (func == FSMC_A12_FUNC            )) ? 12 : \
	((gpio == PG02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG03) && (func == FSMC_A13_FUNC            )) ? 12 : \
	((gpio == PG03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG04) && (func == FSMC_A14_FUNC            )) ? 12 : \
	((gpio == PG04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG05) && (func == FSMC_A15_FUNC            )) ? 12 : \
	((gpio == PG05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG06) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PG06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PG07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PG09) && (func == QUADSPI_BK2_IO2_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == FSMC_NE2_FUNC            )) ? 12 : \
	((gpio == PG09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG10) && (func == FSMC_NE3_FUNC            )) ? 12 : \
	((gpio == PG10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG11) && (func == CAN2_RX_FUNC             )) ?  9 : \
	((gpio == PG11) && (func == UART10_RX_FUNC           )) ? 11 : \
	((gpio == PG11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG12) && (func == CAN2_TX_FUNC             )) ?  9 : \
	((gpio == PG12) && (func == UART10_TX_FUNC           )) ? 11 : \
	((gpio == PG12) && (func == FSMC_NE4_FUNC            )) ? 12 : \
	((gpio == PG12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG13) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG13) && (func == FSMC_A24_FUNC            )) ? 12 : \
	((gpio == PG13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG14) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PG14) && (func == QUADSPI_BK2_IO3_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == FSMC_A25_FUNC            )) ? 12 : \
	((gpio == PG14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

